pkg/org-ruby-0.6.2/spec/html_examples/lists.org
* Lists

I want to make sure I have great support for lists.

- This is an unordered list
- This continues the unordered list

And this is a paragraph *after* the list.

** Wrapping within the list

   - This is a single-line list item in the org file.
   - Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam
     nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam
     erat, sed diam voluptua. At vero eos et accusam et justo duo
     dolores et ea rebum. Stet clita kasd gubergren, no sea takimata
     sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit
     amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor
     invidunt ut labore et dolore magna aliquyam erat, sed diam
     voluptua. At vero eos et accusam et justo duo dolores et ea
     rebum. Stet clita kasd gubergren, no sea takimata sanctus est
     Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet,
     consetetur sadipscing elitr, sed diam nonumy eirmod tempor
     invidunt ut labore et dolore magna aliquyam erat, sed diam
     voluptua. At vero eos et accusam et justo duo dolores et ea
     rebum. Stet clita kasd gubergren, no sea takimata sanctus est
     Lorem ipsum dolor sit amet.
   - And this is the next item. The previous item needs to be on one
     line to keep =textile= happy.
   - Ditto the previous line, actually.

** Edge cases

   - This is a single-line list.
   And this is a *separate paragraph.* Note the indentation in the org
   file.
   
** Invalid lists

   Note that spaces are required to denote lists. Thus, none of the following
   should get recognized as lists.
   
   -This isn't a list.
   -And this isn't a list.
   
   1.And this isn't a list.
   2.And this isn't a list.
