spec/html_examples/lists.html
<h1 class="title">Lists</h1>
<p>I want to make sure I have great support for lists.</p>
<ul>
  <li>This is an unordered list</li>
  <li>This continues the unordered list</li>
</ul>
<p>And this is a paragraph <b>after</b> the list.</p>
<h2>Wrapping within the list</h2>
<ul>
  <li>This is a single-line list item in the org file.</li>
  <li>Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.</li>
  <li>And this is the next item. The previous item needs to be on one line to keep <code>textile</code> happy.</li>
  <li>Ditto the previous line, actually.</li>
</ul>
<h2>Edge cases</h2>
<ul>
  <li>This is a single-line list.</li>
</ul>
<p>And this is a <b>separate paragraph.</b> Note the indentation in the org file.</p>
<h2>Invalid lists</h2>
<p>Note that spaces are required to denote lists. Thus, none of the following should get recognized as lists.</p>
<ul>
  <li>This isn&#8217;t a list.</li>
  <li>And this isn&#8217;t a list.</li>
  <li>And this isn&#8217;t a list.</li>
  <li>And this isn&#8217;t a list.</li>
</ul>
